{
  "common": {
    "loading": {
      "title": "Načítání...",
      "description": ""
    },
    "error": "Nastala chyba. Zkuste to prosím znovu.",
    "notFound": {
      "title": "404",
      "description": "Stránka, kterou hledáte, neexistuje.",
      "buttonText": "Zpět na domovskou stránku"
    }
  },
  "metadata": {
    "title": "Ondřej Pták | Fullstack vývojář",
    "description": "Specializuji se na navrhování a vytváření moderních, responzivních webových aplikací, které poskytují výjimečné uživatelské zkušenosti a podporují obchodní růst.",
    "workTitle": "Ondřej Pták | Projekty",
    "projectTitle": "Ondřej Pták | ",
    "experienceTitle": "Ondřej Pták | Zkušenosti",
    "aboutTitle": "Ondřej Pták | O mně",
    "contactTitle": "Ondřej Pták | Kontakt"
  },
  "header": {
    "home": "Domů",
    "work": "Projekty",
    "experience": "Zkušenosti",
    "about": "O mně",
    "contact": "Kontakt",
    "language": {
      "title": "Jazyk",
      "en": "Anglicky",
      "cs": "Česky"
    }
  },
  "home": {
    "about": {
      "title": "Ondřej Pták",
      "location": "Plzeň, Česká republika",
      "description": {
        "0": "Jsem 20-letý český Fullstack vývojář, který se specializuje na vytváření moderních a responzivních webových aplikací.",
        "1": "Mám i zkušenosti s backendem, což mi umožňuje lépe porozumět celému procesu vývoje aplikací.",
        "2": "V současné době pracuji na několika projektech, které vám rád ukážu."
      }
    },
    "skills": {
      "title": "Dovednosti",
      "description": "Zde jsou některé z technologií, které ovládám."
    },
    "work": {
      "title": "Práce & Projekty",
      "description": "Zde jsou některé z projektů, na kterých jsem v minulosti pracoval.",
      "buttonText": "Zobrazit projekty"
    },
    "experience": {
      "title": "Zkušenosti",
      "description": "Zde jsou některé z mých zkušeností v oblasti vývoje webových aplikací.",
      "buttonText": "Zobrazit zkušenosti"
    }
  },
  "footer": {
    "text": "Vytvořeno s ❤ v České republice"
  },
  "projects": {
    "title": "Projekty",
    "description": "Zde jsou některé z projektů, na kterých jsem v minulosti pracoval.",
    "buttonText": "Zobrazit detaily",
    "moreTech": "A více...",
    "swipeImage": "Přejeďte pro zobrazení více obrázků",
    "links": {
      "github": "GitHub",
      "live": "Živá ukázka"
    },
    "featured": {
      "title": "Vybrané projekty",
      "description": "Zde jsou některé z projektů, na kterých jsem v minulosti pracoval.",
      "buttonText": "Zobrazit více"
    },
    "buffet": {
      "title": "VOŠ a SPŠE | Buffet rezervace",
      "description": "Vytvořil jsem celý frontend pro rezervační systém jídel ve školním buffetu. Projekt byl v rámci maturitního projektu na SPŠE a VOŠ v Plzni 2024/2025.",
      "detailedDescription": "Vytvořil jsem celý frontend pro rezervační systém jídel ve školním buffetu. Projekt byl vytvořen v rámci maturitního projektu na SPŠE a VOŠ v Plzni 2024/2025. Umožňuje uživatelům procházet menu, přidávat položky do košíku a provádět objednávky. Správci mohou spravovat menu, objednávky. Frontend jsem vytvořil v Reactu s TailwindCSS. Backend byl napsán v PHP mým spolužákem. Aplikace komunikuje s backendem přes REST API."
    },
    "pixelverse": {
      "title": "PixelVerse | Komunitní platforma pro pixelové umělce",
      "description": "Vytvořil jsem moderní komunitní platformu pro pixelové umělce, která umožňuje sdílet tvorbu, komentovat příspěvky a objevovat nová díla v rámci pixel art komunity.",
      "detailedDescription": "Vytvořil jsem moderní komunitní platformu pro pixelové umělce, která umožňuje sdílet tvorbu, komentovat příspěvky a objevovat nová díla v rámci pixel art komunity. Projekt byl navržen s důrazem na škálovatelnost, čistý design a plynulou uživatelskou zkušenost napříč zařízeními. Aplikace obsahuje systém uživatelských profilů, komentářů, hodnocení a achievementů, a díky integraci s Clerk a Sanity.io poskytuje bezpečnou autentizaci a správu obsahu."
    }
  },
  "experience": {
    "title": "Zkušenosti",
    "description": "Zde jsou některé z mých zkušeností v oblasti vývoje webových aplikací.",
    "education": {
      "highschool": {
        "title": "VOŠ a SPŠE Plzeň",
        "subtitle": "Maturita s vyznamenáním | Vývoj aplikací a webových stránek",
        "description": "Studoval jsem na VOŠ a SPŠE Plzeň, kde získávám znalosti v programování a vývoji webu. Dále pracuji na svém absolventském projektu, který se zaměřuje na vytvoření rezervačního systému jídel pro školní bufet"
      },
      "university": {
        "title": "Fakulta aplikovaných věd - Západočeská univerzita v Plzni",
        "subtitle": "Studium | Software Engineering",
        "description": "Momentálně studuji 1. ročník na Fakultě aplikovaných věd program Softwarové inženýrství"
      }
    },
    "ownprojects": {
      "title": "Vlastní projekty",
      "subtitle": "Fullstack vývojář",
      "description": "Pracuji jako freelance Fullstack vývojář, kde se podílím na různých projektech. Mám zkušenosti s vývojem webových aplikací, které zahrnují jak frontend, tak backend."
    },
    "projects": {
      "buffet": {
        "title": "VOŠ a SPŠE | Buffet rezervace",
        "subtitle": "Maturitní projekt",
        "description": "Vytvořil jsem celý frontend pro rezervační systém jídel ve školním buffetu. Projekt byl v rámci maturitního projektu na VOŠ a SPŠE Plzeň 2024/2025."
      },
      "pixelverse": {
        "title": "PixelVerse | Komunitní platforma pro pixelové umělce",
        "subtitle": "Personal project",
        "description": "I created a modern community platform for pixel artists, which allows users to share their art, comment on posts and discover new works within the pixel art community. The project was designed with scalability in mind, clean design and smooth user experience across devices. The application includes user profile system, comments, ratings and achievements, and thanks to integration with Clerk and Sanity.io provides secure authentication and content management."
      }
    }
  }
}
