{
  "metadata": {
    "title": "Ondřej Pták | Fullstack developer",
    "description": "I specialize in designing and building modern, responsive web applications that deliver exceptional user experiences and drive business growth."
  },
  "header": {
    "home": "Home",
    "work": "Projects",
    "experience": "Experience",
    "about": "About me",
    "contact": "Contact",
    "language": {
      "title": "Language",
      "en": "English",
      "cs": "Czech"
    }
  },
  "home": {
    "about": {
      "title": "Ondřej Pták",
      "location": "Pilsen, Czech Republic",
      "description": {
        "0": "I am a 19 year old Czech Fullstack developer who has been interested in programming since 8th grade.",
        "1": "I specialize in web application development and I am currently working on several projects that I will be happy to show you.",
        "2": "I am currently in my last year of high school specializing in application development."
      }
    },
    "skills": {
      "title": "Skills",
      "description": "Here are some of the technologies I am proficient in."
    },
    "work": {
      "title": "Work & Projects",
      "description": "Here are some of the projects I have worked on in the past.",
      "buttonText": "View projects"
    },
    "experience": {
      "title": "Experience",
      "description": "Here are some of my experiences in web application development.",
      "buttonText": "View experience"
    }
  },
  "footer": {
    "text": "Made with ❤ by Ondřej in Pilsen"
  },
  "projects": {
    "buttonText": "View details",
    "buffet": {
      "title": "SPŠE a VOŠ | Buffet reservation",
      "description": "I created the entire frontend for the meal reservation system in the school buffet. The project was part of the graduation project at SPŠE and VOŠ in Pilsen 2024/2025.",
      "detailedDescription": "I created the entire frontend for the meal reservation system in the school buffet. The project was part of the graduation project at SPŠE and VOŠ 2024/2025. It allows users to browse the menu, add items to the cart, and place orders. Administrators can manage the menu, orders, and user accounts."
    }
  }
}
